### Terraform Plan: `dev`
```
module.platform.data.aws_caller_identity.current: Reading...
data.aws_eks_cluster.this: Reading...
module.platform.data.aws_region.current: Reading...
module.platform.module.vpc.aws_iam_role.flow_logs: Refreshing state... [id=platform-sre-demo-dev-vpc-flow-logs-role]
module.platform.module.eks.aws_iam_policy.lb_controller: Refreshing state... [id=arn:aws:iam::936249129410:policy/platform-sre-demo-dev-eks-lb-controller]
module.platform.module.eks.aws_iam_role.node_group: Refreshing state... [id=platform-sre-demo-dev-eks-node-role]
module.platform.module.eks.aws_kms_key.eks: Refreshing state... [id=2fb270e1-46ea-41c2-81fd-ae73297d3140]
module.platform.module.eks.data.aws_region.current: Reading...
module.platform.module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/platform-sre-demo-dev/flow-logs]
module.platform.module.vpc.aws_vpc.this: Refreshing state... [id=vpc-000895d38dda84305]
module.platform.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.platform.module.eks.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_eks_cluster_auth.this: Reading...
module.platform.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b086ff1eb2a441fa]
data.aws_eks_cluster_auth.this: Read complete after 0s [id=platform-sre-demo-dev-eks]
module.platform.module.eks.aws_iam_role.cluster: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role]
module.platform.data.aws_caller_identity.current: Read complete after 0s [id=936249129410]
module.platform.module.eks.aws_kms_alias.eks: Refreshing state... [id=alias/platform-sre-demo-dev-eks-kms]
module.platform.module.eks.aws_iam_role_policy_attachment.node_ssm: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260308221815142000000004]
module.platform.module.eks.aws_iam_role_policy_attachment.node_worker: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260308221815052000000001]
module.platform.module.eks.aws_iam_role_policy_attachment.node_cni: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260308221815071500000002]
module.platform.module.eks.aws_iam_role_policy_attachment.node_ecr: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260308221815098800000003]
data.aws_eks_cluster.this: Read complete after 1s [id=platform-sre-demo-dev-eks]
module.platform.module.eks.aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role-20260308221815190400000006]
module.platform.module.eks.aws_iam_role_policy_attachment.cluster_vpc_controller: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role-20260308221815172100000005]
module.platform.module.vpc.aws_iam_role_policy.flow_logs: Refreshing state... [id=platform-sre-demo-dev-vpc-flow-logs-role:flow-logs-policy]
module.platform.module.vpc.aws_flow_log.this: Refreshing state... [id=fl-078f545b57e241472]
module.platform.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03ffd85ffac85bbee]
module.platform.module.vpc.aws_route_table.database: Refreshing state... [id=rtb-046e7ac40fba96971]
module.platform.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0137c5c37c37f4fa2]
module.platform.module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0f702b323439d0d2c]
module.platform.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01ed493dc65a94f67]
module.platform.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-003dce8d1eedd3339]
module.platform.module.eks.aws_security_group.cluster: Refreshing state... [id=sg-0f04d7b991b0a04e8]
module.platform.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f38cd6390a23a248]
module.platform.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-029be1b577312bd30]
module.platform.module.eks.aws_security_group.node: Refreshing state... [id=sg-040d0de731b0e6650]
module.platform.module.vpc.aws_route_table.public: Refreshing state... [id=rtb-047535650d0f112d6]
module.platform.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-027a7587089199530]
module.platform.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-056ea357323e9bf1c]
module.platform.module.vpc.aws_db_subnet_group.this: Refreshing state... [id=platform-sre-demo-dev-db-subnet-group]
module.platform.module.eks.aws_eks_cluster.this: Refreshing state... [id=platform-sre-demo-dev-eks]
module.platform.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dfe7e83bd1d5232d]
module.platform.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-063a73f663b8dbb25]
module.platform.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04debc666116b7dca]
module.platform.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a99b569a37a55b39]
module.platform.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a2769587c0fd8778]
module.platform.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05315247fee1f2624]
module.platform.module.eks.aws_eks_node_group.default: Refreshing state... [id=platform-sre-demo-dev-eks:platform-sre-demo-dev-eks-default]
module.platform.module.eks.aws_eks_addon.vpc_cni: Refreshing state... [id=platform-sre-demo-dev-eks:vpc-cni]
module.platform.module.eks.aws_eks_addon.kube_proxy: Refreshing state... [id=platform-sre-demo-dev-eks:kube-proxy]
module.platform.module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/EE58BD1229BE4A6E7F1C1D7735C8FB3C]
module.platform.module.eks.aws_eks_access_entry.node: Refreshing state... [id=platform-sre-demo-dev-eks:arn:aws:iam::936249129410:role/platform-sre-demo-dev-eks-node-role]
module.platform.module.eks.aws_iam_role.lb_controller: Refreshing state... [id=platform-sre-demo-dev-eks-lb-controller]
module.platform.module.eks.aws_eks_addon.coredns: Refreshing state... [id=platform-sre-demo-dev-eks:coredns]
module.platform.module.eks.aws_iam_role_policy_attachment.lb_controller: Refreshing state... [id=platform-sre-demo-dev-eks-lb-controller-2026030822280555120000000a]
module.platform.module.eks.helm_release.lb_controller[0]: Refreshing state... [id=aws-load-balancer-controller]
module.platform.module.rds.random_password.db: Refreshing state... [id=none]
module.platform.module.rds.aws_kms_key.rds: Refreshing state... [id=2398b87e-9046-40eb-abd1-b0d5023d4cf9]
module.platform.module.rds.aws_iam_role.rds_monitoring: Refreshing state... [id=platform-sre-demo-dev-rds-monitoring]
module.platform.module.rds.aws_db_subnet_group.this: Refreshing state... [id=platform-sre-demo-dev-rds]
module.platform.module.rds.aws_db_parameter_group.this: Refreshing state... [id=platform-sre-demo-dev-pg16-20260308234742195400000003]
module.platform.module.observability.aws_kms_key.sns: Refreshing state... [id=c57ef01b-8d53-43df-9b93-e1fd9a5c78c8]
module.platform.module.rds.aws_secretsmanager_secret.db: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:936249129410:secret:platform-sre-demo-dev/rds/credentials-g9OMh4]
module.platform.module.rds.aws_security_group.rds: Refreshing state... [id=sg-05a4251ef001aeccd]
module.platform.module.rds.aws_security_group_rule.rds_ingress[0]: Refreshing state... [id=sgrule-32937961]
module.platform.module.rds.aws_iam_role_policy_attachment.rds_monitoring: Refreshing state... [id=platform-sre-demo-dev-rds-monitoring-20260308234742566900000004]
module.platform.module.rds.aws_secretsmanager_secret_version.db: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:936249129410:secret:platform-sre-demo-dev/rds/credentials-g9OMh4|terraform-20260309013711040000000002]
module.platform.module.observability.aws_sns_topic.alerts: Refreshing state... [id=arn:aws:sns:us-east-1:936249129410:platform-sre-demo-dev-alerts]
module.platform.module.observability.aws_cloudwatch_metric_alarm.node_cpu_high: Refreshing state... [id=platform-sre-demo-dev-node-cpu-high]
module.platform.module.observability.aws_cloudwatch_metric_alarm.node_memory_high: Refreshing state... [id=platform-sre-demo-dev-node-memory-high]
module.platform.module.observability.aws_cloudwatch_metric_alarm.rds_cpu_high: Refreshing state... [id=platform-sre-demo-dev-rds-cpu-high]
module.platform.module.observability.aws_cloudwatch_metric_alarm.rds_storage_low: Refreshing state... [id=platform-sre-demo-dev-rds-storage-low]
module.platform.module.rds.aws_db_instance.this: Refreshing state... [id=db-I3FT2QVWRGDIL265VQCIDO2CCY]
module.platform.module.app.kubernetes_namespace.app: Refreshing state... [id=demo]
module.platform.module.app.kubernetes_config_map.app: Refreshing state... [id=demo/platform-sre-demo-config]
module.platform.module.app.kubernetes_service.app: Refreshing state... [id=demo/platform-sre-demo]
module.platform.module.app.kubernetes_deployment.app: Refreshing state... [id=demo/platform-sre-demo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform.module.eks.data.tls_certificate.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/EE58BD1229BE4A6E7F1C1D7735C8FB3C"
    }

  # module.platform.module.eks.aws_eks_cluster.this will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "platform-sre-demo-dev-eks"
        name                          = "platform-sre-demo-dev-eks"
        tags                          = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
      ~ version                       = "1.33" -> "1.34"
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.platform.module.eks.aws_iam_openid_connect_provider.eks will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "eks" {
        id              = "arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/EE58BD1229BE4A6E7F1C1D7735C8FB3C"
        tags            = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.platform.module.observability.data.aws_cloudwatch_log_group.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_cloudwatch_log_group" "eks" {
      + arn               = (known after apply)
      + creation_time     = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/platform-sre-demo-dev-eks/cluster"
      + retention_in_days = (known after apply)
      + tags              = (known after apply)
    }

  # module.platform.module.rds.aws_db_parameter_group.this will be updated in-place
  ~ resource "aws_db_parameter_group" "this" {
        id           = "platform-sre-demo-dev-pg16-20260308234742195400000003"
        name         = "platform-sre-demo-dev-pg16-20260308234742195400000003"
        tags         = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
        # (6 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "rds.force_ssl" -> null
          - value        = "1" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "rds.force_ssl"
          + value        = "1"
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Triggered by @ahalsey in 4e489d68700385e4d53e8ab93fc052d65850ecc1*